import 'package:csp_mobile_app/api/chatBot_api.dart';
import 'package:flutter/cupertino.dart';

class ChatModel {
  String question;
  String answer;
  int order;

  ChatModel(this.answer, this.order, this.question);

  ChatModel.fromJson(Map? json)
      : question = json?["question"] ?? "",
        answer = json?["answer"] ?? "",
        order = json?["order"] ?? 0;

  // List<String> _answers = [
  //   "هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر  هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر   هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر  ",
  //   "هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبالشاطهر  ",
  //   "هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر  هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر   هو ببساطه نص شكلى بع ودور النشر  ",
  //   "هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر  هو ببساطه نص شكلى بمعنى ان الغايه هي الشكل وليس المحتوى وبستخدم فى صناعات المطابع ودور النشر   هو ببساطه نص شكلى بمعنى ان الغايه هي شر  ",
  // ];
  // late Map<String, String> questions;
  // String lastElement = "اخبار الطريق";

  // ChatModel() {
  //   questions = {
  //     "ما هى سرعه الطريق الحالى ؟": _answers[0],
  //     "سعر رسوم عبور البوابه": _answers[1],
  //     "الطقس الحالى على الطريق": _answers[2],
  //     lastElement: _answers[3],
  //   };
  // }
}

   // String lastElement = "اخبار الطريق";

  // ChatModel() {
  //   questions = {
  //     "ما هى سرعه الطريق الحالى ؟": _answers[0],
  //     "سعر رسوم عبور البوابه": _answers[1],
  //     "الطقس الحالى على الطريق": _answers[2],
  //     lastElement: _answers[3],
  //   };
  // }
